## 1.

In [322]:
# 1.
import pandas as pd


df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'], 'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'], 'C': [1, 2, 3, 4, 5, 6, 7, 8]})

pivot = pd.pivot_table(df, values='C', index='A', columns='B', aggfunc='sum')

In [323]:

pivot

B    one  three  two
A
bar    2      4    6
foo    8      8    8

In [324]:
# 2.
import pandas as pd


df1 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'qux'], 'value': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'qux'], 'value': [5, 6, 7, 8]})


merged = pd.merge(df1, df2, on='key')

In [325]:
merged

   key  value_x  value_y
0  foo        1        5
1  bar        2        6
2  baz        3        7
3  qux        4        8

In [326]:
# 3.
import pandas as pd


df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'], 'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'], 'C': [1, 2, 3, 4, 5, 6, 7, 8]})


grouped = df.groupby('A')

In [327]:
grouped.sum()

      C
A
bar  12
foo  24

In [328]:
# 4.
import pandas as pd


df = pd.DataFrame({'A': [1, 2, None, 4], 'B': [5, 6, 7, None]})


df = df.dropna()

In [329]:
df

     A    B
0  1.0  5.0
1  2.0  6.0

In [330]:
# 5.
import pandas as pd


df=pd.read_csv('https://media.githubusercontent.com/media/datablist/sample-csv-files/main/files/organizations/organizations-100.csv')

In [331]:
df.head(5)

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,1,FAB0d41d5b5d22c,Ferrell LLC,https://price.net/,Papua New Guinea,Horizontal empowering knowledgebase,1990,Plastics,3498
1,2,6A7EdDEA9FaDC52,"Mckinney, Riley and Day",http://www.hall-buchanan.info/,Finland,User-centric system-worthy leverage,2015,Glass / Ceramics / Concrete,4952
2,3,0bFED1ADAE4bcC1,Hester Ltd,http://sullivan-reed.com/,China,Switchable scalable moratorium,1971,Public Safety,5287
3,4,2bFC1Be8a4ce42f,Holder-Sellers,https://becker.com/,Turkmenistan,De-engineered systemic artificial intelligence,2004,Automotive,921
4,5,9eE8A6a4Eb96C24,Mayer Group,http://www.brewer.com/,Mauritius,Synchronized needs-based challenge,1991,Transportation,7870

## 2.

In [332]:
import pandas as pd

def reindex_dataframe(df):
   
    new_index = range(1, 2*len(df), 2)
    
   
    df = df.reindex(new_index)
    
    return df

In [333]:

df = pd.DataFrame({'A': [20, 40, 60], 'B': [80, 45, 70], 'C': [75, 25, 90]})


df = reindex_dataframe(df)

In [334]:
df

      A     B     C
1  40.0  45.0  25.0
3   NaN   NaN   NaN
5   NaN   NaN   NaN

## 3.

In [335]:
import pandas as pd

def calculate_sum(df):
   
    total = 0
    
    
    for val in df['Values'][:3]:
        total += val
        
    
    print(f"The sum of the first three values in the 'Values' column is: {total}")

In [336]:

df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})


calculate_sum(df)

The sum of the first three values in the 'Values' column is: 60

## 4.

In [337]:
import pandas as pd

def add_word_count(df):
    df['Word_Count'] = 0

    for i, row in df.iterrows():
    
        word_count = len(row['Text'].split())
        
        df.at[i, 'Word_Count'] = word_count

In [338]:

df = pd.DataFrame({'Text': ['This is a test', 'Here is another sentence', 'One more sentence']})


add_word_count(df)

In [339]:
df

                       Text  Word_Count
0            This is a test           4
1  Here is another sentence           4
2         One more sentence           3

## 5.

* DataFrame.size(): returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns. The method returns an integer value.

In [340]:
import pandas as pd

In [341]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

In [342]:
df.size

9

* DataFrame.shape(): returns a tuple that contains the number of rows and the number of columns in the DataFrame, respectively. So, if a DataFrame has n rows and m columns, the method returns a tuple of the form (n, m). This method is useful to quickly get the dimensions of a DataFrame.

In [343]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

In [344]:
df.shape

(3, 3)

## 6.

In [345]:
import pandas as pd

In [346]:
df= pd.read_excel("ir211wk12sample.xls")

In [347]:
df.head(10)

,OrderDate,Region,Rep,Item,Units,Unit Cost,Total,Unnamed: 7,Bins,Frequency,Intervals,Unnamed: 11,Item Type,Frequency.1,Rel. Freq,% Freq.
0,2014-09-01,Central,Smith,Desk,2.0,125.00,250.00,NaN,9.0,6.0,0-9,NaN,Pencil,13.0,0.302326,0.302326
1,2015-06-17,Central,Kivell,Desk,5.0,125.00,625.00,NaN,19.0,4.0,10-19,NaN,Binder,15.0,0.348837,0.348837
2,2015-09-10,Central,Gill,Pencil,7.0,1.29,9.03,NaN,29.0,4.0,20-29,NaN,Pen,5.0,0.116279,0.116279
3,2015-11-17,Central,Jardine,Binder,11.0,4.99,54.89,NaN,39.0,3.0,30-39,NaN,Pen Set,7.0,0.162791,0.162791
4,2015-10-31,Central,Andrews,Pencil,14.0,1.29,18.06,NaN,49.0,2.0,40-49,NaN,Desk,3.0,0.069767,0.069767
5,2014-02-26,Central,Gill,Pen,27.0,19.99,539.73,NaN,59.0,6.0,50-59,NaN,NaN,43.0,1.000000,1.000000
6,2014-10-05,Central,Morgan,Binder,28.0,8.99,251.72,NaN,69.0,6.0,60-69,NaN,NaN,NaN,NaN,NaN
7,2015-12-21,Central,Andrews,Binder,28.0,4.99,139.72,NaN,79.0,3.0,70-79,NaN,NaN,NaN,NaN,NaN
8,2014-02-09,Central,Jardine,Pencil,36.0,4.99,179.64,NaN,89.0,3.0,80-89,NaN,10-19,NaN,NaN,NaN
9,2015-08-07,Central,Kivell,Pen Set,42.0,23.95,1005.90,NaN,99.0,6.0,90-99,NaN,NaN,NaN,NaN,NaN

## 7.

In [348]:
import pandas as pd

In [349]:
def extract_username(df):
    df['Username'] = df['Email'].str.split('@').str[0]
    return df

In [350]:
df = pd.DataFrame({'Email': ['john.doe@example.com', 'jane.doe@example.com']})

In [351]:
df = extract_username(df)

In [352]:
df

                  Email  Username
0  john.doe@example.com  john.doe
1  jane.doe@example.com  jane.doe

In [353]:
df_copy = df.copy()

In [354]:
df_copy = extract_username(df_copy)

In [355]:
df_copy

                  Email  Username
0  john.doe@example.com  john.doe
1  jane.doe@example.com  jane.doe

## 8.

In [356]:
import pandas as pd

def filter_dataframe(df):
    filtered_df = df[(df['A'] > 5) & (df['B'] < 10)]
    return filtered_df

In [357]:

df = pd.DataFrame({'A': [3, 8, 6, 2, 9],
                   'B': [5, 2, 9, 3, 1],
                   'C': [1, 7, 4, 5, 2]})

In [358]:
filtered_df = filter_dataframe(df)

In [359]:
filtered_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2